      **
      * COPY BOOK GENRE DATA FILE
      **
       01  REG-GEN.                 *> LRECL 15
           05 CODIGO-GEN            PIC 9(02).
           05 DESC-GEN              PIC X(08).
           05 FILLER                PIC X(03).
